# FilterableValueProvider Properties

---
The FilterableValueProvider type exposes the following members.
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
Top
#### Reference
FilterableValueProvider Class
Autodesk.Revit.DB Namespace